tap "aws/tap"
tap "buo/cask-upgrade"
tap "jeffreywildman/virt-manager"
tap "netbirdio/tap"
tap "syncdk/aws-session-manager-plugin"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Core application library for C
brew "glib"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bash Automated Testing System
brew "bats-core"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Cross-platform C++ GUI toolkit
brew "fltk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Popular GNU data compression program
brew "gzip"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Utilities for manipulating PostScript documents
brew "psutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rsync for cloud storage
brew "rclone"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to impose load on and stress test a computer system
brew "stress"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", link: false
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"
# AWS Simple EC2 CLI is a tool that simplifies the process of launching, connecting and terminating an EC2 instance
brew "aws/tap/aws-simple-ec2-cli"
# App for virtualized guest interaction
brew "jeffreywildman/virt-manager/virt-viewer"
# Official Amazon AWS session manager plugin
brew "syncdk/aws-session-manager-plugin/aws-session-manager-plugin"
# Android SDK component
cask "android-platform-tools"
# Allows connection to a computer remotely
cask "anydesk"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Server and cloud storage browser
cask "cyberduck"
# Online diagram software
cask "drawio"
# Desktop client for Ente Auth
cask "ente-auth"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Web browser
cask "firefox@esr"
# PDF reader
cask "foxitreader"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Agent-centric IDE with spec-driven development
cask "kiro"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Netbird UI Client
cask "netbirdio/tap/netbird-ui"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Centralises all remote connections on a single platform
cask "remote-desktop-manager"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# CLI to create, run, and deploy Slack apps
cask "slack-cli"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Customizable email client
cask "thunderbird@esr"
# Client for the Tresorit cloud storage service
cask "tresorit"
# License free Wi-Fi, VPN, and Access Application for Organizations
cask "unifi-identity-endpoint"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network monitoring and troubleshooting tool
cask "wifiman"
# Connect to Windows
cask "windows-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother iPrint&Scan", id: 1193539993
mas "Brother P-touch Editor", id: 1453365242
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "dandric.vscode-jq"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kddejong.vscode-cfn-lint"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "vthiery.prettify-selected-json"
