amazonwebservices.aws-toolkit-vscode
dandric.vscode-jq
docker.docker
dotjoshjohnson.xml
eamodio.gitlens
foxundermoon.shell-format
github.copilot-chat
github.vscode-pull-request-github
jq-syntax-highlighting.jq-syntax-highlighting
kddejong.vscode-cfn-lint
mermaidchart.vscode-mermaid-chart
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.powershell
ms-vscode.remote-repositories
redhat.ansible
redhat.vscode-yaml
shakram02.bash-beautify
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
timonwong.shellcheck
vthiery.prettify-selected-json
